[
    {
        "title": "April 2017: Tails of Equestria",
        "date": "2017-04-01T00:00:00.000Z",
        "file": "Tails of Equestria 2017.pdf",
        "body": "A speak preview of a new game I'm going to be supporting."
    },
    {
        "title": "April 2018: Tails of Fallout Equestria",
        "date": "2018-04-01T00:00:00.000Z",
        "file": "Tails of Fallout Equestria 2018.pdf",
        "body": "There've been a lot of interesting developments in table-top RPGs in the last year. Here's a little sneak preview of something I'm working on."
    },
    {
        "title": "April 2020: Starfinder Refresh",
        "date": "2020-04-01T00:00:00.000Z",
        "file": "Starfinder 2020.pdf",
        "body": "I'm looking to make a slight style change to the Starfinder sheets. What do people think of the attached?"
    },
    {
        "title": "April 2021: The Perfect Character Sheet",
        "date": "2021-04-01T00:00:00.000Z",
        "file": "Perfect 2021.pdf",
        "body": "After years of development, I'm finally ready to give you... the most perfect character sheet ever!"
    },
    {
        "title": "The Blockchain",
        "date": "2022-01-31T00:17:00.000Z",
        "body": "Just to head off the inevitable question, Dyslexic Character Sheets will NOT be participating in NFTs or cryptocurrencies in any way.\nAnyone who'd like more details is welcome to listen to a tape of me laughing for 45 minutes, followed by a two hour lecture on how money works, what the blockchain actually is, and why your money is best kept far, far away from the whole thing."
    },
    {
        "title": "April 2022: 3D Character Sheets",
        "date": "2022-04-01T00:00:00.000Z",
        "file": "3D Character Sheet 2022.html",
        "body": "Our tabletop games are increasingly 3D. We have 3D VTTs with 3D animated maps, 3D printed miniatures, and of course we roll 3D dice. But we're still using the same flat old 2D character sheets we've had since the 1970s!\nIt's time for that to change. Dyslexic Character Sheets is proud to give you a special preview of the first ever 3D character sheet..."
    },
    {
        "title": "Edit and Save is live!",
        "date": "2022-06-03T13:44:00.000Z",
        "body": "After more than a year working on it, I've finally released some massive new features:\n- Edit all the fields in the character sheet, including proficiencies, alignment, etc.\n- Calculations work automatically (*)\n- Save your character sheet\nThese features are for patrons only. You'll need to subscribe (at the $1 minimum rate) and log in using your Patreon account to get the benefits.\nFull editing has been the #1 requested feature in all the years I've been building these. It was only made possible because of the way the new Pathfinder 2e sheets are built - which, sadly, means it doesn't apply the Pathfinder 1e, Starfinder or D&D 3.5e character sheets.\nWhile these new features are only for patrons, the character sheets themselves are as free as they always have been. Accessibility features and translations are also free. For a breakdown of exactly what's free and what's reserved, see the Patrons page.\n(*) Not all the classes and archetypes are fully calculated yet, but most of them should be."
    },
    {
        "title": "Some thoughts on One D&D and the OGL",
        "date": "2022-11-17T21:25:00.000Z",
        "body": "I've seen rumours that One D&D won't be getting a OGL.\nIf you're not familiar with it, the Open Game License is a legal document that permits anybody to use the D&D rules in their own publications provided they respect their intellectual property. It's what allows third-party publishers to make adventures and other content for the game, it's what allows games like Pathfinder to exist, and it's what allows me to make character sheets legally.\nThe openness of the game has spawned a great deal of the creativity that's blossomed in the RPG space. Without it, D&D would not be the commercial success it is now.\nIt sounds like WotC sees all this money going to other people and want to get that for themselves. The move into the digital space, with the purchase of D&D Beyond and the development of their own VTT, indicates that they want to own the whole D&D experience. If true, this is a short-sighted decision, both for WotC and for the hobby as a whole.\nI have no insider information. I don't know if this rumour is true.\nBut I do know that, without a legal framework, I could not make character sheets for it. Nor would I want to."
    },
    {
        "title": "On the OGL",
        "date": "2023-01-07T00:00:00.000Z",
        "body": "You've probably seen this already: <a href='https://gizmodo.com/dnd-wizards-of-the-coast-ogl-1-1-open-gaming-license-1849950634'>Dungeons & Dragons’ New License Tightens Its Grip on Competition</a>.\nI was waiting to see what One D&D looked like before deciding whether to make character sheets for it. Well, if there's any truth at all to these reports (and they look pretty solid), then I won't be going anywhere near it."
    },
    {
        "title": "Dark archive - live!",
        "date": "2023-01-17T00:00:00.000Z",
        "body": "The Dark Archive release is now live!"
    },
    {
        "title": "The OGL Fiasco",
        "date": "2023-03-10T00:00:00.000Z",
        "body": "It's been a month or so now since the end of the OGL fiasco. While I was actively posting news during it, once it ended I wanted to take some time and get some perspective before posting my full thoughts.\nAlso this ended up being a really long post, so I've split it into three parts. You can read them on Patreon:\n<a href='https://www.patreon.com/posts/ogl-fiasco-part-79461831'>Part 1</a>\n<a href='https://www.patreon.com/posts/ogl-fiasco-part-79560240'>Part 2</a>\n<a href='https://www.patreon.com/posts/ogl-fiasco-part-79760180'>Part 3</a>"
    },
    {
        "title": "Kingmaker",
        "date": "2023-05-06T00:00:00.000Z",
        "body": "Happy coronation day!\nThe character sheets for Kingmaker for Pathfinder Second Edition are now live. This includes sheets for kingdoms, settlements, and armies.\nThere are also a number of other bug fixes and additions in this release, such as the Pine Leshy heritage from the Quest for the Frozen Flame adventure path."
    },
    {
        "title": "Patreon and Discord",
        "date": "2023-07-09T00:00:00.000Z",
        "body": "It looks like new patrons who click through to Discord aren't getting the 'Patron' role assigned properly. This is related to Discord's decision to make everyone change their username.\nIf you're a new patron and you want the right role, just ask and I'll fix it."
    },
    {
        "title": "Kineticist live",
        "date": "2023-11-11T00:00:00.000Z",
        "body": "I've just released a number of things:\n- Kineticist (and the Kineticist archetype)\n- Variant rules: Ancestry Paragon, Automatic Bonus Progression and Proficiency Without Level\n- The new PDF builder for PF1, Starfinder and D&D 3.5\n- The option to hide values for print (patrons only)\n- A whole load of little bug fixes"
    },
    {
        "title": "A year on",
        "date": "2024-01-05T00:00:00.000Z",
        "body": "It's a year now since the OGL crisis hit.\nIt's hard to explain just how deeply it affected everyone who creates things for TTRPGs. Just how worried, angry and betrayed it made us feel.\nD&D is more than just a property that a company can own. It's a folk game, and a whole community and identity built around it. It's the product of countless people, some of them working for the hundreds of publishers, or the thousands of part-time creators, but most of all it's the many players and DMs who've made this game what it is.\nIt seems obscene that a profit-seeking company could have control over it, and more so that they could choose to take the whole thing away.\nThat nightmare was averted this time, due to the speed and scale of our reaction. Executives honestly didn't expect the reaction they got - because they don't actually know anything about the players or community. Just think on that. This catastrophic course of action was taken by people who don't care enough to get to know the people it affects.\nAnd it wasn't even smart greed. I'm used to greed - I live in capitalism the same as the rest of you. It was incompetent, self-defeating greed, that wouldn't even have served their business interests even if it had worked entirely according to plan. And those idiots are getting million-dollar bonuses now.\nI'm not going to replay the events of the crisis blow-by-blow. I expect you'll see plenty of that in the next few days. I just want you to remember why it mattered."
    },
    {
        "title": "New website!",
        "date": "2024-07-01T00:00:00.000Z",
        "body": "The new website for Dyslexic Character Sheets is live!"
    }
]
